# WoodLatewoodSharpness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodLatewoodSharpness Property
AdvancedWood Class See Also
---
The property labeled "Percentage of pure latewood" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodLatewoodSharpness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodLatewoodSharpness As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodLatewoodSharpness {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace